#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=a663acabc1e85273dbb43bc82999de83860a6602ea3ff3a7dab4621ee5f909b8]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=3688111357]
random_id.id_flow: Refreshing state... [id=ufv5w2ozwO8]
module.ubunturoutervm.random_id.randomid_pip[0]: Refreshing state... [id=N4jWfw]
module.ubunturoutervm.random_id.randomIdVM: Refreshing state... [id=qQ9YUoT6nBQ]
module.spoke1network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001]
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001]
data.azurerm_key_vault.secrets: Reading...
module.spoke2network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001]
azurerm_resource_group.rg_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001]
module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/publicIPAddresses/pip-vm-hub-dev-001]
module.ubunturoutervm.random_id.randomId[0]: Refreshing state... [id=h_sohoMzDBU]
module.spoke2network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001]
module.ubunturoutervm.azurerm_storage_account.spokestorageaccount[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diag87fb288683330c15]
module.spoke1network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001]
module.spoke1network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001]
azurerm_network_watcher.networkwatcher_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub]
azurerm_virtual_network.hub_vnet: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001]
azurerm_storage_account.flow: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Storage/storageAccounts/stflowb9fbf9c36a33c0ef]
azurerm_log_analytics_workspace.law_platform: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.OperationalInsights/workspaces/law-platform]
azurerm_network_security_group.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
module.spoke1network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
data.azurerm_key_vault.secrets: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-tf-infra-001/providers/Microsoft.KeyVault/vaults/kv-tf-infra-sec-001]
module.spoke2network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
azurerm_subnet.hub_subnet["RouterSubnet"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
data.azurerm_key_vault_secret.vmpassword: Reading...
data.azurerm_monitor_diagnostic_categories.nsg_logs: Reading...
module.spoke1network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/virtualNetworkPeerings/vnet-spoke1-001-hub]
module.spoke2network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/virtualNetworkPeerings/vnet-spoke2-001-hub]
module.spoke1network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke1-001]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
azurerm_subnet_network_security_group_association.nsg_router-association: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
module.ubunturoutervm.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-hub-dev-001-a90f585284fa9c14]
azurerm_monitor_diagnostic_setting.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router|nsg_router_diag]
module.spoke1network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001/routes/default-route-entry]
module.spoke2network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001/routes/default-route-entry]
data.azurerm_key_vault_secret.vmpassword: Read complete after 1s [id=https://kv-tf-infra-sec-001.vault.azure.net/secrets/vmpassword/cd3cca8343d14d4890d1645375fe30fc]
module.ubunturoutervm.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001]
azurerm_network_watcher_flow_log.spoke1: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke1-flow]
azurerm_network_watcher_flow_log.spoke2: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke2flow]
azurerm_network_watcher_flow_log.hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/hub-flow]
azurerm_virtual_machine_extension.ubunturoutervm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001/extensions/vm-hub-dev-001-networkwatcher]
module.ubuntuspoke2.random_id.randomIdVM: Refreshing state... [id=6Z5NKFxmZaQ]
module.ubuntuspoke1.random_id.randomIdVM: Refreshing state... [id=RHBx4BeBJoU]
module.ubuntuspoke1.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-447071e017812685]
module.ubuntuspoke2.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-e99e4d285c6665a4]
module.ubuntuspoke1.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001]
module.ubuntuspoke2.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001]
azurerm_network_connection_monitor.ubunturoutervm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-hub-dev-001-ubuntucom]
azurerm_virtual_machine_extension.spoke1vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001/extensions/vm-spoke1-dev-001-networkwatcher]
azurerm_virtual_machine_extension.spoke2vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001/extensions/vm-spoke2-dev-001-networkwatcher]
azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom]
azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom will be updated in-place
  ~ resource "azurerm_network_connection_monitor" "spoke1vm_monitor_ubuntucom" {
        id                            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom"
        name                          = "vm-spoke1-dev-001-ubuntucom"
        tags                          = {
            "environment" = "Dev"
        }
        # (4 unchanged attributes hidden)

      - endpoint {
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "vm-spoke1-dev-001" -> null
          - target_resource_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001" -> null
            # (3 unchanged attributes hidden)
        }
      - endpoint {
          - address               = "archive.ubuntu.com" -> null
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "archive.ubuntu.com" -> null
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke1-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom will be updated in-place
  ~ resource "azurerm_network_connection_monitor" "spoke2vm_monitor_ubuntucom" {
        id                            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom"
        name                          = "vm-spoke2-dev-001-ubuntucom"
        tags                          = {
            "environment" = "Dev"
        }
        # (4 unchanged attributes hidden)

      - endpoint {
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "vm-spoke2-dev-001" -> null
          - target_resource_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001" -> null
            # (3 unchanged attributes hidden)
        }
      - endpoint {
          - address               = "archive.ubuntu.com" -> null
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "archive.ubuntu.com" -> null
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke2-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine_extension.spoke1vm_networkwatcher must be replaced
-/+ resource "azurerm_virtual_machine_extension" "spoke1vm_networkwatcher" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001/extensions/vm-spoke1-dev-001-networkwatcher" -> (known after apply)
        name                        = "vm-spoke1-dev-001-networkwatcher"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.spoke2vm_networkwatcher must be replaced
-/+ resource "azurerm_virtual_machine_extension" "spoke2vm_networkwatcher" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001/extensions/vm-spoke2-dev-001-networkwatcher" -> (known after apply)
        name                        = "vm-spoke2-dev-001-networkwatcher"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.ubunturoutervm.azurerm_linux_virtual_machine.spokevm will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "spokevm" {
        id                                                     = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001"
        name                                                   = "vm-hub-dev-001"
        tags                                                   = {
            "environment" = "Dev"
        }
        # (41 unchanged attributes hidden)

      - boot_diagnostics {
          - storage_account_uri = "https://diag87fb288683330c15.blob.core.windows.net/" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.ubunturoutervm.azurerm_storage_account.spokestorageaccount[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_storage_account" "spokestorageaccount" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diag87fb288683330c15" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "swedencentral" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "diag87fb288683330c15" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://diag87fb288683330c15.blob.core.windows.net/" -> null
      - primary_blob_host                  = "diag87fb288683330c15.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://diag87fb288683330c15.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "diag87fb288683330c15.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://diag87fb288683330c15.file.core.windows.net/" -> null
      - primary_file_host                  = "diag87fb288683330c15.file.core.windows.net" -> null
      - primary_location                   = "swedencentral" -> null
      - primary_queue_endpoint             = "https://diag87fb288683330c15.queue.core.windows.net/" -> null
      - primary_queue_host                 = "diag87fb288683330c15.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://diag87fb288683330c15.table.core.windows.net/" -> null
      - primary_table_host                 = "diag87fb288683330c15.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://diag87fb288683330c15.z1.web.core.windows.net/" -> null
      - primary_web_host                   = "diag87fb288683330c15.z1.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "rg-compute-001" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "environment" = "Dev"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
              - "Logging",
              - "Metrics",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [
              - "20.52.95.48",
              - "51.116.75.88",
              - "51.12.22.174",
              - "51.12.72.223",
            ] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - sas_policy {
          - expiration_action = "Log" -> null
          - expiration_period = "90.00:00:00" -> null
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.ubunturoutervm.random_id.randomId[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "random_id" "randomId" {
      - b64_std     = "h/sohoMzDBU=" -> null
      - b64_url     = "h_sohoMzDBU" -> null
      - byte_length = 8 -> null
      - dec         = "9798469972466535445" -> null
      - hex         = "87fb288683330c15" -> null
      - id          = "h_sohoMzDBU" -> null
      - keepers     = {
          - "resource_group" = "rg-compute-001"
        } -> null
    }

  # module.ubuntuspoke1.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke1.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "modules/ubuntuvm/cloudconfig_linux.tpl"
    }

  # module.ubuntuspoke1.azurerm_linux_virtual_machine.spokevm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "spokevm" {
      ~ custom_data                                            = (sensitive value) # forces replacement
      + disk_controller_type                                   = (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001" -> (known after apply)
        name                                                   = "vm-spoke1-dev-001"
      ~ private_ip_address                                     = "10.100.1.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.100.1.4",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id                                     = "f016f60c-c866-499e-9213-865dbf060886" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (31 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb                     = 30 -> (known after apply)
          ~ name                             = "vm-spoke1-dev-001_OsDisk_1_6d809a52fdf746309be30a71ec967841" -> (known after apply)
            # (6 unchanged attributes hidden)
        }

      ~ termination_notification (known after apply)

        # (1 unchanged block hidden)
    }

  # module.ubuntuspoke2.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke2.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "modules/ubuntuvm/cloudconfig_linux.tpl"
    }

  # module.ubuntuspoke2.azurerm_linux_virtual_machine.spokevm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "spokevm" {
      ~ custom_data                                            = (sensitive value) # forces replacement
      + disk_controller_type                                   = (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001" -> (known after apply)
        name                                                   = "vm-spoke2-dev-001"
      ~ private_ip_address                                     = "10.101.1.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.101.1.4",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id                                     = "272e306b-f028-428c-b33e-9032f3ac0076" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (31 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb                     = 30 -> (known after apply)
          ~ name                             = "vm-spoke2-dev-001_OsDisk_1_8ca0d664e3e64382950b971047276ac4" -> (known after apply)
            # (6 unchanged attributes hidden)
        }

      ~ termination_notification (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*